app/controllers/signin_controller.rb

  def signin
    @user = User.find(:last, :conditions => {:nick => params[:user][:nick]})
    if not @user
      @user = User.new
      @user.nick = params[:user][:nick]
    end
    @user.is_there = !@user.is_there
    @user.save if params[:user][:nick] # Don't save user if no nick is given
---
SELECT * FROM "users" WHERE ("users"."nick" = 'paul_be') ORDER BY users.id DESC LIMIT 1
INSERT INTO "users" ("created_at", "nick", "updated_at", "is_there") VALUES('2011-05-03 21:04:56', 'paul_be', '2011-05-03 21:04:56', NULL)
UPDATE "users" SET "updated_at" = '2011-05-03 21:19:33', "is_there" = 't' WHERE "id" = 3